var name = "Болдоо";
var age = 33;
console.log(this.name + " нэртэй хүн " + age + " настай.");

// Доорх байдлаар хувьсагчуудыг давхардуулж зарласан тохиолдолд өмнө нь зарлаж байсан хувьсагчууд өөрчлөгдөж өмнөх утгаар нь дахин ашиглах боломжгүй болдог
// ------------------------------
// var name = "Цэцгээ";
// var age = 21;
// console.log(name + " нэртэй хүн " + age + " настай.");

// "Цэцгээ нэртэй хүн 21 настай." гэж хэвлэхдээ var гэж зарласан хувьсагчуудыг IIFE ашиглан хаа нэгтэйгээс хандах боломжгүйгээр "өгөгдлийн далдлалт" хийж өгсөн
// ------------------------------
// (function () {
//   var name = "Цэцгээ";
//   var age = 21;
//   console.log(name + " нэртэй хүн " + age + " настай.");
// })();

// Хувьсагчаа let гэж зарласнаар IIFE гэх мэт төвөгтэй бичиглэл ашиглахгүйгээр block scope дотор л тухайн хувьсагчдыг ажилладаг болгож, гаднаас хандах боломжгүйгээр өгөгдлийн далдлалт хийж болно
// ------------------------------
{
  let name = "Цэцгээ";
  let age = 21;
  const address = "ub";
  console.log(name + " нэртэй хүн " + age + " настай.");
}

// "Болдоо нэртэй хүн 33 настай." гэж дахин хэвлэхийг оролдож байна
// ------------------------------
console.log(this.name + " нэртэй хүн " + age + " настай.");
console.log(this.name + " нэртэй хүн " + age + " настай.");
