let dict = new Map();

dict.set("нэг", "one");
dict.set("хоёр", "two");
dict.set("language", "хэл");
dict.set("car", "машин");
dict.set("sun", "нар");
dict.set("аав", "father");
dict.set("хоёр", "сар");

dict.delete("language");

console.log(dict);
console.log(dict.get("car"));
console.log(dict.get("хоёр"));

dict.forEach((value, key) => console.log(key + " ===> " + value));

for (let el of dict) {
  console.log(el);
  console.log(el[1]);
}

for (let [a, b] of dict) {
  console.log("key: " + a + "  value: " + b);
}

console.log(dict.size);

console.log(dict.has("car"));
console.log(dict.has("сар"));

let text = `Монгол Улс БНПУ хоёрын хооронд 1950 онд дипломат харилцаа тогтоосноос хойш манай хоёр орон бүхий л салбарт уламжлалт түүхэн харилцаагаа хадгалж иржээ. Социализмын үед хоёр орны харилцаа эрчимтэй хөгжиж байсан бөгөөд Дархан хотыг бүтээн байгуулахад Польш мэргэжилтнүүд гар бие оролцож, өөрийн орны технологийн онцлог бүхий Дарханы Царууц тоосго, шохойн үйлдвэрийг байгуулж, Монгол орны өнцөг булан бүрээс ирсэн залуусыг сурган дадлагажуулж байлаа. 1966-1985 онд Польшийн тусламжтайгаар Улаанбаатар, Дархан, Чойбалсан, Хархоринд нийт 9 үйлдвэрийг ашиглалтад оруулжээ.

Сүүлийн үед хэрэгжиж буй төсөл хөтөлбөрүүдээс дурдвал 2013 онд Монгол Улсын Ерөнхийлөгч Ц.Элбэгдоржийн Бүгд Найрамдах Польш Улсад хийсэн айлчлал болон хоёр улсын Засгийн газар хоорондын уулзалт, яриа хэлэлцээг үндэслэн 50 сая еврогийн экспортын зээлийг Эдийн засгийн хамтын ажиллагаа, хөгжлийн байгууллага (OECD)-ын “нөхцөлт тусламж”-ийн журмын дагуу Монгол Улсад олгохоор болсон байна.

Ийнхүү “Монгол Улсын Засгийн газар, БНПУ-ын Засгийн газар хоорондын нөхцөлт зээлийн хэлэлцээр”-т 2017 оны 5 сард гарын үсэг зуржээ. Улмаар Нөхцөлт зээлийн  хэлэлцээр 2018 оны 7 дугаар сард дуусгавар болсныг 2021 онд дахин сунгасан юм байна. Энэхүү хөнгөлөлттэй зээл нь нийгэм эдийн засгийн хөгжлийг дэмжих хоёр улсын эдийн засгийн хамтын ажиллагааг гүнзгийлүүлэх зорилготой бөгөөд 28 жилийн хугацаатай, жилийн 0,15 хувийн хүүтэй мөн эхний 5 жилд үндсэн төлбөрөөс чөлөөлөх нөхцөлтэй тул Монгол Улсын хувьд маш ашигтай зээлд тооцогддог аж.`;

console.log(text);

// Бүх үгийг салгаж аваад массивт хийе
let words = text.split(" ");
console.log(words);
console.log("rawrawWords: ", words.length);

// Үг бүрийн цэг, таслал, тодорхойлох тэмдэгтэй холилдсоныг шалгаж цэвэрлэж Map руу хийнэ
let rawWords = new Map();

words.forEach((el) => {
  if (el.includes(".")) {
    rawWords.set(el.replace(".", ""), 1);
  } else if (el.includes(",")) {
    rawWords.set(el.replace(",", ""), 1);
  } else if (el.includes("“")) {
    rawWords.set(el.replace("“", ""), 1);
  } else if (el.includes("”")) {
    rawWords.set(el.replace("”", ""), 1);
  } else {
    rawWords.set(el, 1);
  }
});
console.log("rawWords: ", rawWords);

let cleanWords = new Map();

rawWords.forEach((el, value) => {
  value === "" || value.length < 3
    ? rawWords.delete(el)
    : cleanWords.set(value, 1);
});

console.log("cleanWords: ", cleanWords);

// Map Ийн хэмжээг харна
console.log("Нийт давхардаагүй үгийн тоо : " + cleanWords.size);
